---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetPropertyBoolean
source: html/595c3094-eb42-f27d-9b54-4891e157616b.htm
---
# AssetPropertyBoolean Members

Adds a new connected asset attached to this asset property, if it allows it.